<html>
<body>

<!--
https://www.youtube.com/watch?v=fi6ZtRPqJi8
https://www.youtube.com/watch?v=jRIOPBnwHFM
https://www.youtube.com/watch?v=0vDjqC-Uh3Y
https://www.youtube.com/watch?v=DRLOnZbr-ms
https://www.youtube.com/watch?v=EnHHOiqpdlQ
-->
<H1>Tutoriales</H1>

<DIV>
<H2>
Registro y primera pieza
</H2>
<iframe width="1120" height="630" src="https://www.youtube.com/embed/fi6ZtRPqJi8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
<span>
El video muestra c&oacute;mo crear una cuenta en la web de Model3fab y c&oacute;mo crear una colecci&oacute;n. Para crear una cuenta, se debe ir a la parte del registro en la web y completar el formulario con email y password. Luego, se puede crear una nueva colecci&oacute;n y agregar objetos a ella. Para agregar un objeto, se debe hacer clic en el bot&oacute;n "nuevo elemento" y agregar las dimensiones y el material. Finalmente, se puede guardar la colecci&oacute;n en la base de datos.
</span>
</DIV>
<DIV>

<H2>
Importar materiales
</H2>
<iframe width="1120" height="630" src="https://www.youtube.com/embed/jRIOPBnwHFM" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
<span>
El video muestra c&oacute;mo importar nuevos materiales en una colecci&oacute;n. Para hacerlo, se debe ir al men&uacute; de fichero y seleccionar importar materiales. Luego, se seleccionan los materiales que se desean importar y se hace clic en importar. Los materiales importados estar&aacute;n disponibles en la colecci&oacute;n.
</span>

</DIV>
<DIV>

<H2>
Creaci&oacute;n de sujeta libros
</H2>
<iframe width="1120" height="630" src="https://www.youtube.com/embed/0vDjqC-Uh3Y" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
<span>
El video muestra c&oacute;mo crear un sujeta libros en Model3fab. Para crear un objeto, se debe agregar un bloque de tipo caja y agregar las dimensiones en los ejes X, Y y Z. Luego, se puede agregar otro bloque de tipo caja para crear la base del objeto. Para desplazar el bloque de la base, se debe mover en el eje X. Finalmente, se puede agregar el material deseado y guardar el objeto.
</span>




</DIV>
<DIV>

<H2>
Par&aacute;metros
</H2>
<iframe width="1120" height="630" src="https://www.youtube.com/embed/DRLOnZbr-ms" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
<span>
El video muestra c&oacute;mo a&ntilde;adir par&aacute;metros al  sujetalibros en Model3fab. Para hacerlo, se deben agregar dos par&aacute;metros para la altura y el largo. Luego, se puede agregar el par&aacute;metro de altura a la pieza vertical. Para agregar el par&aacute;metro, se debe copiar el par&aacute;metro de altura y pegarlo en la pieza vertical. Finalmente, se puede agregar agregar el par&aacute;metro de largo a la pieza horizontal. Para agregar el par&aacute;metro de espesor, se debe elegir el tipo de par&aacute;metro "opciones" y agregar las opciones de espesor. Finalmente, se puede guardar el sujeta libros.
</span>


</DIV>
<DIV>

<H2>
&Oacute;rdenes y creaci&oacute;n de librer&iacute;a
</H2>
<iframe width="1120" height="630" src="https://www.youtube.com/embed/EnHHOiqpdlQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
<span>
El video muestra c&oacute;mo guardar una colecci&oacute;n en Model3fab. Para hacerlo, se debe dar clic en "guardar" y esperar a que se guarde en la base de datos. Luego, se puede dar un nombre al objeto y hacerlo p&uacute;blico. Para compartir el objeto, se puede copiar el enlace y enviarlo a un usuario final. Para crear un segundo mueble, se puede duplicar el primer objeto y darle un nuevo nombre. Luego, se puede agregar un par&aacute;metro para el n&uacute;mero de baldas y guardar la colecci&oacute;n.
Para modificar el tama&ntilde;o, se debe agregar un par&aacute;metro para el ancho y otro para el el alto. Para agregar varias baldas, se debe agregar un par&aacute;metro para el n&uacute;mero de baldas y utilizar el tama&ntilde;o para definir la posici&oacute;n de las baldas. Para separar las baldas, se debe utilizar el alto y dividirlo entre el n&uacute;mero de baldas. Finalmente, se puede ajustar la posici&oacute;n de las baldas.
</span>
</DIV>
<style>
div {
//  border: 3px solid #4CAF50;
  padding: 5px;
}

iframe {
  float: right;
}
p {
  float: left;
}


DIV {
  content: "";
  clear: both;
  display: table;
}
</style>
</body>
</html>
